ocake/ocake/app/Models/Cart_m.php

    public function getCartData() {
        return $this->db->table('cart as c')
                        ->select('*')
                        ->join('product as p','p.id=c.product_id')
---
SELECT *
FROM `cart` as `c`
JOIN `product` as `p` ON `p`.`id`=`c`.`product_id`