ocake/ocake/app/Models/Orders_model.php

SELECT *
FROM `product_order` as `po`
JOIN `product` as `p` ON `p`.`id`=`po`.`product_id`
---
    public function fetchProduct()
    {
        return $this->db->table('product_order as po')
        ->select('*')
        ->join('product as p','p.id=po.product_id')