ocake/ocake/app/Models/Product_model.php

    public function fetchProduct() {
      return $this->select('*')
                  ->get()->getResult();
---
SELECT *
FROM `product`

    public function getBDay($occasion) {
        return $this->select('*')->where('occasion', $occasion)
                    ->get()->getResult();
---
SELECT *
FROM `product`
WHERE `occasion` = 'Birthday'